; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=165, out_folder=./training, instance_id=15, seed=2039, goal_proportion=0.03

(define (problem blocksworld-15)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 - object)
 (:init 
    (arm-empty)
    (clear b97)
    (on b97 b148)
    (on b148 b105)
    (on b105 b143)
    (on b143 b12)
    (on-table b12)
    (clear b37)
    (on-table b37)
    (clear b162)
    (on-table b162)
    (clear b164)
    (on b164 b86)
    (on b86 b28)
    (on b28 b5)
    (on b5 b132)
    (on b132 b96)
    (on b96 b72)
    (on b72 b47)
    (on-table b47)
    (clear b153)
    (on b153 b101)
    (on b101 b157)
    (on b157 b50)
    (on-table b50)
    (clear b62)
    (on-table b62)
    (clear b110)
    (on b110 b59)
    (on b59 b16)
    (on-table b16)
    (clear b160)
    (on b160 b31)
    (on b31 b44)
    (on b44 b60)
    (on-table b60)
    (clear b76)
    (on b76 b85)
    (on b85 b32)
    (on b32 b54)
    (on-table b54)
    (clear b25)
    (on b25 b147)
    (on b147 b42)
    (on b42 b152)
    (on b152 b52)
    (on b52 b79)
    (on b79 b91)
    (on b91 b146)
    (on b146 b65)
    (on b65 b57)
    (on b57 b53)
    (on b53 b8)
    (on-table b8)
    (clear b33)
    (on-table b33)
    (clear b123)
    (on b123 b156)
    (on b156 b71)
    (on b71 b23)
    (on-table b23)
    (clear b36)
    (on b36 b3)
    (on b3 b113)
    (on b113 b126)
    (on-table b126)
    (clear b83)
    (on-table b83)
    (clear b119)
    (on-table b119)
    (clear b130)
    (on b130 b125)
    (on b125 b40)
    (on-table b40)
    (clear b48)
    (on b48 b134)
    (on-table b134)
    (clear b30)
    (on-table b30)
    (clear b56)
    (on b56 b104)
    (on b104 b145)
    (on-table b145)
    (clear b29)
    (on b29 b137)
    (on-table b137)
    (clear b13)
    (on b13 b1)
    (on-table b1)
    (clear b98)
    (on-table b98)
    (clear b64)
    (on b64 b89)
    (on b89 b115)
    (on b115 b108)
    (on b108 b87)
    (on b87 b99)
    (on-table b99)
    (clear b158)
    (on b158 b92)
    (on b92 b20)
    (on-table b20)
    (clear b136)
    (on b136 b106)
    (on b106 b2)
    (on b2 b131)
    (on-table b131)
    (clear b26)
    (on-table b26)
    (clear b118)
    (on b118 b81)
    (on b81 b107)
    (on b107 b112)
    (on b112 b117)
    (on-table b117)
    (clear b35)
    (on-table b35)
    (clear b46)
    (on-table b46)
    (clear b151)
    (on b151 b116)
    (on b116 b88)
    (on-table b88)
    (clear b27)
    (on b27 b94)
    (on b94 b49)
    (on b49 b70)
    (on b70 b141)
    (on b141 b155)
    (on b155 b67)
    (on-table b67)
    (clear b38)
    (on-table b38)
    (clear b111)
    (on b111 b127)
    (on b127 b22)
    (on b22 b10)
    (on b10 b129)
    (on b129 b41)
    (on-table b41)
    (clear b78)
    (on b78 b128)
    (on b128 b93)
    (on-table b93)
    (clear b90)
    (on b90 b17)
    (on b17 b75)
    (on b75 b73)
    (on b73 b19)
    (on-table b19)
    (clear b15)
    (on-table b15)
    (clear b61)
    (on b61 b114)
    (on b114 b133)
    (on-table b133)
    (clear b159)
    (on-table b159)
    (clear b11)
    (on b11 b84)
    (on b84 b121)
    (on-table b121)
    (clear b45)
    (on b45 b142)
    (on b142 b122)
    (on b122 b21)
    (on-table b21)
    (clear b43)
    (on b43 b58)
    (on b58 b135)
    (on b135 b63)
    (on-table b63)
    (clear b24)
    (on b24 b140)
    (on b140 b161)
    (on-table b161)
    (clear b18)
    (on b18 b163)
    (on b163 b14)
    (on b14 b124)
    (on b124 b95)
    (on b95 b69)
    (on b69 b103)
    (on-table b103)
    (clear b68)
    (on-table b68)
    (clear b55)
    (on b55 b9)
    (on b9 b109)
    (on-table b109)
    (clear b100)
    (on b100 b139)
    (on b139 b6)
    (on-table b6)
    (clear b77)
    (on b77 b34)
    (on b34 b149)
    (on b149 b39)
    (on b39 b80)
    (on b80 b51)
    (on-table b51)
    (clear b120)
    (on b120 b7)
    (on b7 b150)
    (on b150 b82)
    (on b82 b154)
    (on b154 b74)
    (on b74 b66)
    (on b66 b144)
    (on b144 b4)
    (on-table b4)
    (clear b102)
    (on-table b102)
    (clear b165)
    (on-table b165)
    (clear b138)
    (on-table b138))
 (:goal  (and 
    (clear b1)
    (on b1 b4)
    (on b4 b3)
    (on b3 b2)
    (on-table b2))))

; plan
1. (unstack b120 b7)
   deleted: (on b120 b7) (clear b120) (arm-empty)
   added: (holding b120) (clear b7)
   goals met: 0 of 5
2. (putdown b120)
   deleted: (holding b120)
   added: (clear b120) (arm-empty) (on-table b120)
   goals met: 0 of 5
3. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 1 of 5
4. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 5
5. (unstack b136 b106)
   deleted: (on b136 b106) (clear b136) (arm-empty)
   added: (holding b136) (clear b106)
   goals met: 1 of 5
6. (putdown b136)
   deleted: (holding b136)
   added: (clear b136) (arm-empty) (on-table b136)
   goals met: 1 of 5
7. (unstack b106 b2)
   deleted: (on b106 b2) (clear b106) (arm-empty)
   added: (holding b106) (clear b2)
   goals met: 1 of 5
8. (putdown b106)
   deleted: (holding b106)
   added: (clear b106) (arm-empty) (on-table b106)
   goals met: 1 of 5
9. (unstack b2 b131)
   deleted: (on b2 b131) (clear b2) (arm-empty)
   added: (holding b2) (clear b131)
   goals met: 1 of 5
10. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 2 of 5
11. (unstack b36 b3)
   deleted: (on b36 b3) (clear b36) (arm-empty)
   added: (holding b36) (clear b3)
   goals met: 2 of 5
12. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 2 of 5
13. (unstack b7 b150)
   deleted: (on b7 b150) (clear b7) (arm-empty)
   added: (holding b7) (clear b150)
   goals met: 2 of 5
14. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 2 of 5
15. (unstack b150 b82)
   deleted: (on b150 b82) (clear b150) (arm-empty)
   added: (holding b150) (clear b82)
   goals met: 2 of 5
16. (putdown b150)
   deleted: (holding b150)
   added: (clear b150) (arm-empty) (on-table b150)
   goals met: 2 of 5
17. (unstack b82 b154)
   deleted: (on b82 b154) (clear b82) (arm-empty)
   added: (holding b82) (clear b154)
   goals met: 2 of 5
18. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 2 of 5
19. (unstack b154 b74)
   deleted: (on b154 b74) (clear b154) (arm-empty)
   added: (holding b154) (clear b74)
   goals met: 2 of 5
20. (putdown b154)
   deleted: (holding b154)
   added: (clear b154) (arm-empty) (on-table b154)
   goals met: 2 of 5
21. (unstack b74 b66)
   deleted: (on b74 b66) (clear b74) (arm-empty)
   added: (holding b74) (clear b66)
   goals met: 2 of 5
22. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 2 of 5
23. (unstack b66 b144)
   deleted: (on b66 b144) (clear b66) (arm-empty)
   added: (holding b66) (clear b144)
   goals met: 2 of 5
24. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 2 of 5
25. (unstack b144 b4)
   deleted: (on b144 b4) (clear b144) (arm-empty)
   added: (holding b144) (clear b4)
   goals met: 2 of 5
26. (putdown b144)
   deleted: (holding b144)
   added: (clear b144) (arm-empty) (on-table b144)
   goals met: 2 of 5
27. (unstack b3 b113)
   deleted: (on b3 b113) (clear b3) (arm-empty)
   added: (holding b3) (clear b113)
   goals met: 2 of 5
28. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 3 of 5
29. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 3 of 5
30. (stack b4 b3)
   deleted: (clear b3) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b3)
   goals met: 4 of 5
31. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 3 of 5
32. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 5 of 5
